Repository: lf-j/Open-Source-Guides-For-The-Enterprise
Catalog: RecruitingDevelopers/tm/Trial-level1.tmx
Source language: en_us
Languages: ja

source: 8 Steps to Open Source Development Impact in and for Your Enterprise
ja: 貴社内における効果的なオープンソース育成のための8ステップ

source: A special thanks goes out to the open source program managers who contributed their time and knowledge to making these comprehensive guides.
ja: 本ガイドの作成にあたり、時間と知識を提供して頂いたオープンソース プログラム マネージャーの皆様に感謝いたします。

source: If approached correctly, such contributions can earn their developers, and by extension, the employer, respect within the community. Developers also raise their visibility within the community by making solid contributions which leads to future job opportunities with companies that also benefit from their work.
ja: 正しいアプローチをもってすれば、これらの貢献はデベロッパー、ひいては採用者である企業のコミュニティー内における敬意の獲得につながります。また、有用な貢献はデベロッパーの認知度向上にもつながり、彼らの能力を必要とする企業への将来的な転職の機会も拡大します。

source: Schedule time for it accordingly.
ja: 必要な時間を前もって確保しましょう。

source: If they work for us that’s great. If they’re working for somebody else that’s also great because when we work together as a project the success of the project is our shared success.”
ja: 彼らが我々の従業員であれば何よりですし、彼らが他社の社員なのであれば、プロジェクトにおける協業の成果を共有できるので、それもまた素晴らしいことです。

source: Were motivated to help them succeed because their success is our success. We’re here to help the projects as well as the people on the projects.”
ja: 彼らの成功は我々の成功でもあるので、彼らを積極的に支援しています。我々は、プロジェクトのみならずプロジェクトの関係者をサポートするようにしています。」[原文：Were→We're]

source: A company that’s new to open source may have less appeal, for example.
ja: 例えば、オープンソースへの新規参入企業は、人材によって魅力的に映らない場合があります。

source: A competitive salary will get them in the door, but to retain them, make sure they are recognized for their contributions to open source.
ja: 競争力のある報酬は採用に役立ちますが、繋ぎ止めるためには、オープンソースの分野における貢献の認知が重要です。

source: A fluid labor pool is also just a natural result of working in the open.
ja: 流動的な労働市場は、オープンな環境で働くということの自然な帰結であるといえます。

source: A new hiring philosophy
ja: 新たな採用哲学

source: A smart strategy identifies all the benefits you’re looking to gain from hiring top talent, and includes tactics for meeting those needs.
ja: 優れた戦略は、トップクラスの人材の採用に求めるメリットをすべて考慮し、それらのニーズを満たすための戦術を内包していなければなりません。

source: According to a recent Cloud Foundry report, there are a quarter-million job openings for software developers in the U.S.
ja: Cloud Foundryが最近作成したレポートによると、米国内だけで25万件の ソフトウェアデベロッパー採用枠と、テクノロジースキルを要する職種で50万件の採用枠があるとされています。

source: According to the latest Open Source Jobs Report, open source developers say the best thing about their job is the ability to work on interesting projects, collaborate with a global community, and work on cutting-edge technology challenges.
ja: 最新のOpen Source Jobs Reportによると、オープンソース デベロッパーが自らの仕事の一番良いところとして、「興味深いプロジェクトに参加できること、グローバルなコミュニティーと協業できること、そして最先端のテクノロジーに挑戦できること」を挙げています。

source: Allow your developers working on products to spend a certain % of their time contributing upstream.
ja: 2. 製品に関連する作業を行っているデベロッパーに、作業時間の一部を上流の開発に貢献するために充当することを許可する。

source: And companies increasingly see the value of paying developers to contribute upstream, for multiple reasons.
ja: そして企業は、デベロッパーの上流への貢献に対価を支払うことに、複数の観点から価値を見出し始めています。

source: And they contribute to your own open source projects.
ja: 貴社内のオープンソースプロジェクトにも貢献します。

source: And they’re forecasting the number of unfillable developer jobs to reach one million within the next decade.
ja: また、同レポートでは、今後10年間でデベロッパーの需要は、供給を100万件上回るとしています。

source: Apprenticeships up the ante a bit with more structured, daily training exposure with top developers in closer supervision.
ja: 徒弟制度においては、より構造化された環境で、トップクラスのデベロッパーのより直接的な管理下で日々の育成が実現されます。

source: As expected, the result has been a steady climb in pay as companies fiercely compete to attract and retain talent.
ja: この状況から容易に予想されるように、これらの人材を獲得・維持するための競争の結果、人件費は継続的に上昇しています。

source: Ask good developers in the company to attract more good developers through strategic networking, speaking engagements at conferences, and collaborating with others on open source projects.
ja: 社内の優秀なデベロッパーに、社外の優秀なデベロッパー獲得に通じる戦略的なネットワーキング、カンファレンスにおける登壇、そしてオープンソース プロジェクトにおける他者との協業などを要請しましょう。

source: Attend and support open source events
ja: オープンソース イベントに参加し、支援する。

source: Attracting and retaining developers to your open source projects is equally important to doing so for employment at your company.
ja: 貴社のオープンソースプロジェクトにデベロッパーを呼び込み、維持することは、貴社での雇用でそうすることと同様に重要です。

source: Be specific and nail the time availability down.
ja: 具体的な数字で、確保する時間を明示しましょう。

source: Be the first to know when we add more open source guides and other content like this.
ja: 同様のコンテンツやオープンソース ガイドなどの公開情報を、いち早くお届けします。

source: Because of this, they tend to be much more focused on the project’s value to the rest of the world, as opposed to making a product valuable to the company who makes it in a proprietary environment.”
ja: これにより、彼らには、ひとつの会社の内製された商品よりも、世間一般に対する同プロジェクトの価値を追求する傾向が強く見受けられます。」

source: Because your success is tied directly to the success of projects and developers, the best strategy is to ensure the success of all by making time for contributions a job priority.
ja: 貴社の成功はプロジェクトやデベロッパーの成功に直接的に結びついているため、貢献のために時間を割く行為を職務上優先させることで全関係者の成功を確約することが、最善の戦略となります。

source: Before we dive into recruitment strategies, let’s talk about why open source participation can be an effective recruitment tool, as well as some of the challenges it presents to retaining top talent (see the next section).
ja: 採用戦略に触れる前に、なぜオープンソースへの参画が効果的な採用ツールとなり得るか、そしてなぜその行為がトップ人材の流出阻止における課題となるか（詳細は次項）について議論します。

source: Besides, you have the added benefit of evaluating their work first hand.
ja: さらに、候補者の能力を直接査定することも可能です。

source: Best practices include searching projects on GitHub and projects that your company already uses to find and approach top contributors who may be interested in a new opportunity or who can suggest someone who is.
ja: GitHubのプロジェクトや貴社が活用しているプロジェクト内において、貢献度が高く新天地を求めている人材やそのような人材を紹介できる人間を探すことがベストプラクティスとなっています。

source: Build your strategy and processes so that developers have a purpose and can see the effects of their work often.
ja: デベロッパーが目的意識を持ち、また自身の仕事の成果を頻繁に目にする機会があるように自社戦略を構築しましょう。

source: But on projects your company deems critical, any delays in effecting project direction can lead to some serious issues in the project’s usability in an employer’s internal projects.
ja: しかし、貴社にとって重要なプロジェクトにおいては、方向性への影響力の確立が遅れた場合、同プロジェクトの貴社内プロジェクトに対する有用性を大きく損ねる可能性があります。

source: But the most effective recruitment strategies aim toward a more complete open source transformation by adopting the tools, practices, and culture that open source developers are familiar with and desire.
ja: しかし、もっとも効果的な採用戦略は、より完全なオープンソースへの変革を目指して、オープンソースのデベロッパーが慣れ親しみ求めるような各種ツール、プラクティス、文化などの導入を伴います。

source: But there are other reasons companies have trouble recruiting established open source developers.
ja: しかし、経験豊富なオープンソース デベロッパーの採用の難しさには、需要過多以外にも理由があります。

source: But this guide is focused on strategies for recruiting developers that you employ.
ja: しかし、本ガイドは貴社が雇用するデベロッパーの採用に焦点を当てていきます。

source: But those are not the only places they can build serious cred.
ja: ただ、それ以外にも高い信頼性を確立できる場所は存在します。

source: But you need a strategy, a set of processes, and goals in order to achieve this.
ja: 一方で、これを達成するためには、戦略、プロセス、そして目的の設定が必要となります。

source: But you will also want to spend time training developers who show an interest or eagerness in contributing to open source.
ja: ただし、オープンソースに貢献したいという興味や意欲を示すデベロッパーの育成にも、一定の時間を割くべきです。

source: But, sometimes initially you’ve got to bootstrap by hiring people who are already leaders in those communities.”
ja: しかし、軌道に乗せるために、場合によっては初期段階で、すでにそのようなコミュニティーでリーダーとなっている人間を採用する必要性も生じることがあります。

source: By all accounts, challenging projects are the top attraction for highly skilled, experienced open source developers.
ja: 誰の意見を聞いても、優秀で経験豊富なオープンソースのデベロッパーにとってもっとも魅力的なのは、チャレンジングなプロジェクトという答えが返ってきます。

source: Camille Fournier says engineers want three things: rewards, respect, and purpose.
ja: Camille Fournier氏は、エンジニアは「報酬・敬意・目的」の三つを欲する、としています。

source: Camille Fournier – Managing Director and head of Platform Engineering at Two Sigma and author of The Manager’s Path: A Guide for Tech Leaders Navigating Growth and Change, at Open Source Leadership Summit
ja: Camille Fournier （Two Sigma マネージング・ディレクターならびにプラットフォーム エンジニアリング責任者ならびにThe Manager’s Path: A Guide for Tech Leaders Navigating Growth and Change著者、Open Source Leadership Summitにおいて）

source: Cannibalizing the open source community for the sake of adding talent to your payroll is self-defeating.
ja: 貴社の雇用を維持する目的でオープンソース コミュニティーを枯渇させることは、最終的に貴社のメリットとなりません。

source: Certainly, training programs are crucial in filling skill gaps and grooming candidates for succession plans should you lose key developers.
ja: 確かに、研修制度は不足しているスキルの穴埋めや主要な人材を失った際の後継者育成において重要な役割を果たします。

source: Challenges to open source retention
ja: オープンソースでの人材流出阻止における課題

source: Collaboration is at the heart of all things open source.
ja: オープンソースに関連するすべての事柄の中心にあるのが、協業の概念です。

source: Companies are often frustrated in their efforts to recruit top open source developers mostly because there are so few available and they’re all in high demand.
ja: オープンソースにおけるトップクラスの人材の採用は、需要過多であることから非常に難しく、各企業にとって大きな課題となります。

source: Companies can attract developers who are looking to up their game in a particular technology by establishing themselves as a desirable destination for open source developers.
ja: 企業は、自らがオープンソース デベロッパーにとって魅力的な職場であるという印象を確立することで、特定の技術分野で成長したいと考えているデベロッパーを採用しやすい状況を作ることができます。.

source: Connecting their open source contributions to their work deliverables rather than letting it be a job perk will keep your developers’ focused on work, while earning them recognition in the community and attracting more developers to your company at the same time.
ja: デベロッパーのオープンソースへの関与を単なる業務上のメリットとするのではなく、業務上の成果物と結びつけることで、彼らの業務意欲を向上させると同時にコミュニティー内における認知度の向上を促し、同時に自社への更なるデベロッパーの誘致までも視野に入れます。

source: Contents
ja: 概要

source: Contribute meaningfully.
ja: 意味のある関与を。

source: Contribute on GitHub »
ja: GitHubに貢献する

source: Contributors to this Guide
ja: 本ガイドへ貢献者

source: Contributors’ work is highly visible, not only to the people working on the project, but potential employers who see their GitHub activity as a public resume.
ja: 貢献者の成果は、プロジェクトに参画している人間だけでなく採用先となり得る企業の目にも止まりやすく、GitHubにおけるアクティビティーは、公開された履歴書のような機能を果たします。

source: Create an internal open source culture.
ja: 社内のオープンソース文化を醸成する。

source: Develop and offer both technical and open source methodology training to your developers.
ja: 4. 技術的な研修やオープンソース手法に関する研修を策定し、デベロッパーに提供する。

source: Developer Shortage
ja: デベロッパーの不足

source: Developers come to conferences to hear about new developments, interesting projects, and cool companies.
ja: デベロッパーは、新しい開発や面白いプロジェクト、クールな会社などの情報を求めてカンファレンスに来場します。

source: Developers gain respect and recognition through their technical contributions to open source projects and their leadership in open source communities.
ja: デベロッパーは、オープンソース プロジェクトへの技術的な貢献やオープンソース コミュニティーにおけるリーダーシップの発揮によって、敬意や認知を得ることができます。

source: Developers have choices in open source, so you need to make your company attractive for the talent to apply.
ja: オープンソースにおいてデベロッパーは売り手市場で選択肢を複数持っているため、企業には自社をより魅力的にする努力が求められます。

source: Developers work on their projects, first and foremost, and can easily move between employers that will pay them to work on the same project.
ja: デベロッパーはプロジェクトを最重要視し、同じプロジェクトに従事する行為に賃金を支払う企業間で容易に転職することができます。

source: Developers who are users or consumers of a project, are the logical candidates for the next generation of maintainers.
ja: 特定のプロジェクトのユーザーは、そのプロジェクトの次世代のメンテナーとしては合理的な選択肢であるといえます。

source: Developing an IT infrastructure that enables developers to communicate and work with the global open source community without any bottlenecks or problems is an important first step.
ja: デベロッパーのグローバルなオープンソース コミュニティーとの円滑な協業を可能にするITインフラの開発は、重要な最初のステップです。

source: Different companies incorporate the ebb and flow of developers coming and leaving their employ into their hiring and retention strategies in different ways.
ja: 会社によって、デベロッパーの入退社の波をどのように採用・雇用維持の戦略に織り込むかの方法論は異なります。

source: Director, Open at Autodesk
ja: Open at Autodesk ディレクター

source: Don’t get me wrong, the money is important as well, but if we think of it as recognition we can separate the monetary value from the emotional value.”
ja: 金銭的な報酬も大事であることに間違いはないが、それを認知の度合いと捉えた場合、金銭的な価値と感情面での価値を分けて考えることができる。

source: Earning respect and building leadership as a corporate participant in open source takes more than one person.
ja: 敬意を獲得し、リーダーシップを醸成するためには、一個人の努力を超えた企業としての参画を要します。

source: Effective recruitment appeals to developer motivation.
ja: 効果的な採用活動は、デベロッパーのモチベーションに訴えかけます。

source: Eighty-nine percent of hiring managers surveyed for the 2017 Open Source Jobs Report cite difficulty in finding the right open source skills and expertise.
ja: 2017 Open Source Jobs Report のアンケートに回答した採用担当者の89%が、必要としているオープンソースのスキルや専門性を持った人材の採用に苦労していると回答しています。

source: Either way, it’s important to have ongoing training programs always in place.
ja: いずれにせよ重要となるのは、常に何らかの研修プログラムを実行し続けることです。

source: Employers must have a complete strategy in place and it has to center on open source transformation — from tools and culture, to your whole philosophy and approach to development.
ja: 採用者である企業は、ツールや文化、哲学、開発アプローチに至るまで、すべての面でオープンソースへの変革に焦点を当てた完全な戦略を立案する必要があります。

source: Even if your code and projects aren’t quite the stuff of legends, you earn a following by proving your worth to the community overall.
ja: コードやプロジェクトが「伝説級」のものでなくても、貴社のコミュニティーに対する存在価値を示すことで、仲間は増えていきます。

source: Experienced open source developers are in short supply.
ja: 経験豊富なオープンソース デベロッパーは常に不足しています。

source: Experienced open source developers can also help to develop your internal open source culture and open source community leadership.
ja: 経験豊富なオープンソースのデベロッパーは、貴社内のオープンソース文化やオープンソース コミュニティーにおけるリーダーシップの醸成に寄与することもできます。

source: Filling the talent pipeline will be important for meeting your open source objectives, including your ability to contribute strategically to the open source projects you depend on, as well as grow your own open source technologies and communities.
ja: 貴社が必要とするオープンソース プロジェクトに対して戦略的に人材を送り込むことや、貴社のオープンソース技術ならびにコミュニティを育成すること含めて、貴社のオープンソース関連の目的達成においてはまず人材のパイプラインを満たすことが重要な役割を果たします。

source: Five Strategies to recruit and retain open source developers
ja: オープンソース デベロッパーの採用・流出阻止のための5つの戦略

source: Five strategies for recruiting open source developers
ja: オープンソース デベロッパーを採用するための5つの戦略

source: For additional ideas on recruiting and retention strategies, see the predecessor to this guide, How to Recruit and Hire Open Source Developers from 2015.
ja: 人材の採用や流出阻止に関するさらなるアイデアをご希望の場合は、本ガイドの以前のバーションである How to Recruit and Hire Open Source Developers（2015年）も併せてご覧ください。

source: For example, Hadoop, the centerpiece of the big data revolution, and something Yahoo knows a lot about given its role in helping birth it.
ja: 例えば、ビッグデータ革命の中枢にいるHadoopと、その誕生に寄与したYahooがあります。

source: For example, lots of companies are investing in cloud based technologies, high-scale data analytics, and machine learning, If you want to attract developers in those areas, you’ll want to position your company as a meaningful participant in those open source ecosystems now.
ja: 例えば、現在多くの企業がクラウドテクノロジー、大規模データアナリティクス、マシンラーニングなどの分野に投資しています。これらの分野のデベロッパーを採用したい場合は、それらのオープンソース エコシステムにおける有力企業としてのポジションを確立することが重要となります。

source: For example, some companies offer more training and project exposure in order to attract more developers, while others prefer a less structured approach to developer support.
ja: 例えば、採用率向上のために研修やプロジェクトへの参加をより強く打ち出す企業もあれば、デベロッパーのサポートにおいて画一性よりも柔軟性を重視する企業もあります。

source: Gil Yehuda – Senior Director of Open Source at Oath (Yahoo + AOL)
ja: Gil Yehuda（Oath (Yahoo + AOL)オープンソース シニアディレクター）

source: Given that only one in eight U.S.
ja: また同レポートによると、

source: Given that so much technology is based on open source these days, most of your tech roles should have something about open source in it.
ja: 昨今のテクノロジーの大半がオープンソースであるため、ほぼすべての職務に何らかのオープンソース的な要素が存在するはずです。

source: Given the growing shortage of experienced open source developers, you’ll need to invest in training programs to strengthen and update the skills of in-house talent.
ja: 経験豊富なオープンソース デベロッパーの枯渇が進む中、内部育成を目的とした研修制度への投資に対する必要性が高まっています。

source: Guy Martin says he and Ibrahim Haddad, back when they started the open source group at Samsung, “were jokingly called the 50% tyrants” because of their strict enforcement of developers spending 50% of their paid working hours on upstream contributions.
ja: Guy Martin氏は、Ibrahim Haddad氏とともにSamsung内でオープンソース グループを立ち上げた際、上流への貢献に勤務時間の半分を割くことをあまりにも厳密に求めたことから「50%の暴君」と冗談半分に呼ばれていたそうです。

source: Guy Martin – Director of Open at Autodesk (Open@ADSK)
ja: Guy Martin（Autodesk (Open@ADSK) Openディレクター）

source: Hackathons are fun challenges packed with rewards (be those cash prizes or bragging rights), so they’re a perfect addition to your recruitment efforts.
ja: ハッカソンは楽しいチャレンジとともに魅力的な報酬（金銭や名声など）が提供されるため、採用活動の一環として申し分ない施策です。

source: Hire key developers and maintainers from the open source projects that are important to you.
ja: 1. 貴社にとって重要となるオープンソース プロジェクトから、主要なデベロッパーやメンテナーを採用。

source: Hiring Difficulty
ja: 採用の難しさ

source: Host a hackathon
ja: ハッカソンの開催。

source: However, all developers run into open source questions.
ja: ただし、オープンソースに関する質問に直面するということは、すべてのデベロッパーに起こります。

source: However, merely offering time on the clock and company resources for developers to contribute to open source projects and communities isn’t enough to attract and retain top talent, either.
ja: ただし、オープンソースプロジェクトやコミュニティーに貢献するための時間的な猶予や会社のリソースを提供するだけでは、トップ人材の採用には不十分です。

source: Ian Varley – Software Architect at Salesforce
ja: Ian Varley （Salesforceソフトウェア アーキテクト）

source: Ibrahim Haddad, PhD @IbrahimAtLinux
ja: Ibrahim Haddad博士 @IbrahimAtLinux

source: If the role has an open source element to it, say so upfront.
ja: 職務にオープンソースの要素がある場合は、その旨を最初から明示しましょう。

source: If you can adapt your projects to the open source processes internally, you’ll be able to succeed in external open source projects, where that flexibility is a must.
ja: オープンソースのプロセスを社内で取り入れることができれば、このような柔軟性が必須となる外部でのオープンソース プロジェクトにおいても成功を収めることができるでしょう。

source: If you understand what attracts developers to work for you, and on your open source projects (and open source, in general) you can structure your strategies in a way that appeals to them.
ja: デベロッパーが貴社ならびに貴社のオープンソースプロジェクト（あるいはオープンソース全般）になぜ魅力を感じるかを理解することで、効果的な戦略を構築することができます。

source: If your code and projects are interesting, they’ll attract developers to your company on their own.
ja: 自社コードやプロジェクトが面白いものであれば、自ずと開発者が集まってきます。

source: If you’re not paying people well, they’re not going to want to come to your company.”
ja: 充分な報酬を支払う用意がなければ、貴社で働きたがる人間を探し当てるのは難しいでしょう。」

source: If you’re trying to quickly gain influence in an open source community where the developers you employ haven’t contributed, or don’t have much sway, hiring someone who is already skilled and influential in that project may be your only option to meet an immediate need.
ja: 特定のオープンソース コミュニティーにおいて貴社のデベロッパーが貢献しておらず発言力を持っていない状況で影響力を早急に確立する必要性がある場合、プロジェクト内でスキルと影響力を持った人材の採用が貴社のニーズを満たす唯一の方法となる場合があります。

source: In order to build leadership, you must lead by example.
ja: そしてリーダーシップを醸成するためには、自ら手本を示さなければなりません。

source: In order to have influence in shaping a project, you must build leadership.
ja: プロジェクトの形成において影響力を持つためには、リーダーシップを醸成する必要があります。

source: In the corporate world, project teams are not usually open to allowing developers from other teams contribute code since it can disrupt their development cadence.
ja: 企業社会においては、開発のペースが乱れる可能性があるため、一般的には外部チームのデベロッパーのコードを取り入れることに否定的です。

source: In the ongoing search for some relief from the talent shortage, employers turn to growing their own talent pool internally.
ja: 企業は、人材不足の解消にむけた継続的な努力の一環として、社内の人材の育成に目を向けます。

source: Incentives and rewards. As mentioned earlier in this guide, open source developers are motivated by rewards, respect, and purpose.
ja: インセンティブと報酬。本ガイドでも述べている通り、オープンソース デベロッパーは報酬、敬意、目的の三つに動機づけられます。

source: Incorporate open source into job descriptions.
ja: 職務内容にオープンソースを追加する。

source: Influential maintainers in open source communities have those skills and use them well.
ja: オープンソース コミュニティーにおいて影響力を持つメンテナーは、それらのスキルを有し、また友好的に活用しています。

source: Informal, on-the-job training with top developers can be kickstarted or supplemented by more formal programs as well.
ja: トップクラスのデベロッパーとのインフォーマルなOJTは、よりフォーマルな研修プログラムで当初から加速させたり、補完することも可能です。

source: Interestingly, when companies pay developers to work in open source communities it feeds all three needs.
ja: 興味深いことに、デベロッパーがオープンソースコミュニティーで働くことに対して企業が対価を支払う場合、上記の三つのニーズはすべて満たされます。

source: Internally, plan on contributing and focus on areas that are useful to more than one business unit/ product line.
ja: 8. 内部的に、複数の事業部門や製品ラインに活用できる分野に注力し貢献する計画を策定する。

source: Invest in training – build talent from within.
ja: 研修への投資：人材の内部育成。

source: It can help with recruiting open source developers of all skill levels.
ja: これは、あらゆるスキル水準のオープンソース デベロッパーの採用においても有用となります。

source: It is also why a personal note from a project’s leaders goes so far, or a mention in a blog.
ja: ブログで功績について触れられることや、プロジェクトリーダーからの個人的なメモが効果的であるのも、同じ理由からだ。

source: It pays to cultivate this next level of developers and include them in the open source decision-making process.
ja: これらの次世代のデベロッパーを育成し、オープンソースの意思決定に参画させることは、将来的に利益をもたらします。

source: It takes time for any developer to establish relationships in a project and gain influence.
ja: デベロッパーがプロジェクト内で人間関係を構築し、影響力を持つようになるには時間がかかります。

source: It’s important to turn this thinking on its head by understanding that open source developers contribute to your company’s success at multiple levels.
ja: 旧来の考えを改め、オープンソースのデベロッパーは複数の観点から貴社の成功に貢献している、と捉えることが重要になります。

source: Jeff Osier-Mixon – Open Source Community Manager at Intel Corporation
ja: Jeff Osier-Mixon（Intel Corporation オープンソースコミュニティーマネージャー）

source: Joining and/or increasing current participation in open source projects makes your company more visible and more attractive to developers who are already skilled and working in that space.
ja: オープンソース プロジェクトに参加したり、関与の度合いを高めることにより、貴社への注目度を高め、その分野で活躍しているデベロッパーの目に止まりやすい状況を作ります。

source: Last but not least, as Camille Fournier said in her talk, “ship often.” Open source developers like to see their work in production, to feel the thrill of finishing something and marking it done.
ja: 最後になりますが、Camille Fournier氏の談話にもあった通り、「出荷は頻繁に行いましょう。」デベロッパーは自らの仕事が製作工程に進むことや、何かを完成させたという達成感を好みます。

source: Many hiring managers say successful recruiting is anchored more to word of mouth than to marketing.
ja: 多くの採用担当者は、成功する採用戦略の秘訣として、マーケティングよりも口コミの重要性を挙げます。

source: Mentorships are a good way to build in more structure, without too much additional overhead.
ja: メンター制度も、コストを抑制しつつ制度の構造化を図る上で有効な施策です。

source: Mix challenging work with less taxing work to prevent exhaustion but keep interest high at the same time.
ja: チャレンジングな仕事と、相対的に負担が少ない仕事を織り交ぜ、疲労の低減とモチベーションの維持を両立しましょう。

source: Money or a certain job title isn’t the end goal.
ja: お金や特定の役職は、最終目的になり得ません。

source: Much like you train developers to code in public, help them present in public.
ja: 公開ベースでコードを書くトレーニングを行うように、外の環境でプレゼンテーションを行うトレーニングも実行しましょう。

source: My company has a hard time hiring developers with the required skills
ja: 自社では、必要とするスキルを持ったデベロッパーの採用に苦労している

source: My company has no problem hiring the skilled developers we need
ja: 自社では、必要な数の熟練したデベロッパーを問題なく採用できている

source: My response is – yes, absolutely – which is why having an open culture that they want to continue to work in is so critical.'”
ja: それに対して、私は「そうだ、だから彼らが離職したくなくなるようなオープンの環境の醸成が必須となる」と答えている。

source: Nithya Ruff – Senior Director Open Source Practice at Comcast
ja: Nithya Ruff （Comcast オープンソース プラクティス シニアディレクター）

source: Not only does this help your developers gain visibility and attract more talent, you are helping ensure that the open source projects you rely upon will support your future technical direction.
ja: デベロッパーの認知度向上や採用への貢献だけでなく、オープンソース プロジェクトが貴社の将来的な方向性をサポートすることにも同時に寄与します。
